app/Http/Controllers/Backend/AdminController.php

select * from `categories` where `categories`.`id` in (1, 6)
select * from `categories`
---
  public function approveJoblist()
  {
    $job=Job::with('category')->get();
    $categories=Category::all();