app/Http/Controllers/Backend/CategoryController.php

select * from `categories`
---
    public function showCategory()
    {
      $category=Category::all();