app/Http/Controllers/Backend/ResumeController.php

select * from `resumes`
---
  public function showResume()
  {
    $resumes=Resume::all();

select * from `resumes` where `id` = '1' limit 1
---
  public function viewResume($id)
  {
    $view=Resume::where('id',$id)->first();

select * from `resumes` where `id` = '1' limit 1
---
  public function editResume($id)
  {
    $edit=Resume::where('id',$id)->first();